{
  "toolbar_items": {
    "home": "Home",
    "advanced_search": "Advanced Search",
    "word_of_the_day": "Feeling Lucky",
    "advertise": "Advertise",
    "blog": "Blog",
    "chatbot": "Chatbot"
  },
  "sample_advertisements": [
    "Discover the world with our premium travel packages. Book now and save 20%!",
    "Upgrade your style with our latest fashion collection. Limited stock available!",
    "Experience the best dining in town with our exclusive deals. Reserve your table today!",
    "Boost your productivity with our advanced tech gadgets. Shop now and get free shipping!",
    "Transform your home with our unique decor items. Order now and get a special discount!"
  ],
  "sample_home": [
    {
      "word": "Qamous",
      "definition": "Welcome to Qamous, a platform for learning colloquial Arabic words and phrases. Our goal is to provide a comprehensive resource for learners of Arabic dialects, including the Egyptian, Levantine, Gulf, and many more dialects."
    },
    {
      "word": "Al-naharda",
      "definition": "The Arabic word \"النهاردة\" (pronounced: al-naharda) translates to \"today\" in English. It is commonly used in various Arabic dialects, including the Egyptian dialect. This term is employed to refer to the current day or the present moment, indicating the temporal context of events or discussions. In English, it is synonymous with \"today,\" representing the immediate time frame in which a conversation or situation is taking place.",
      "example": "Al-naharda ana mabsout 3alashan 3amalt 7aga 7elwa"
    },
    {
      "word": "Ma3lish",
      "definition": "The Arabic word \"معلش\" (pronounced: ma3lish) is a versatile term used in daily conversations, particularly in the Egyptian dialect. Its primary translation is \"never mind\" or \"it's okay\" in English. Ma3lish is employed to express forgiveness, understanding, or to downplay a situation. It serves as a multi-purpose phrase, conveying a sense of reassurance or dismissing minor issues. In various contexts, ma3lish helps maintain a casual and easygoing atmosphere during interactions.",
      "example": "Ma3lish, hatet3awwad"
    },
    {
      "word": "Yalla",
      "definition": "The Arabic word \"يلا\" (pronounced: yalla) is a popular term used across different Arabic dialects, including Levantine, Egyptian, and Gulf dialects. Yalla is a versatile expression that conveys encouragement, motivation, or a sense of urgency. Its primary translation is \"let's go\" or \"come on\" in English. Yalla is commonly used to spur action, rally enthusiasm, or prompt others to join in an activity. Whether used casually among friends or in more formal settings, yalla embodies a dynamic and spirited tone, encouraging engagement and participation.",
      "example": "Tab yalla ana mestaneek"
    },
    {
      "word": "3afak",
      "definition": "The Arabic word \"عفك\" (pronounced: 3afak) is a polite term used in Moroccan Arabic to request or offer something. Its primary translation is \"please\" in English. 3afak is employed to make a polite request, seek assistance, or express courtesy in interactions. This term reflects the cultural emphasis on politeness and respect in Moroccan society, where social etiquette plays a significant role in communication.",
      "example": "3afak, 3tini l-ma"
    },
    {
      "word": "Smaitary",
      "definition": "\"Smaitary\" is an informal Arabic term that refers to intense cold weather. The word is derived from the fusion of \"squee\", or \"saq3\", and \"rain\", or \"matar\", forming \"Samaitary\". Over time, the \"sa\" was transformed into just \"s\", resulting in \"Smaitary\". In Libya, cold weather is described using various terms such as \"safengri\", \"smaitary\", and \"shaloondi\".",
      "example": "Al yawm al-jaw smaitary"
    },
    {
      "word": "Kobaya",
      "definition": "The Arabic word \"كوباية\" (pronounced: kobaya) is a colloquial term used in Egyptian Arabic to refer to a cup or glass. This term is commonly employed in informal contexts, such as casual conversations, social gatherings, or everyday interactions. Kobaya is a versatile word that denotes a container for beverages, typically tea, coffee, or juice.",
      "example": "Eddini kobaya ma3ak"
    },
    {
      "word": "Fakes",
      "definition": "The Egyptian Arabic word \"فاكس\" (although it may read like 'fake.s' but it’s pronounced 'fak.es') translates to \"no\" in English. So if someone asks you if you want to go to this place for dinner, just saying fakes will do the trick.",
      "example": "Wana awga3 demaghi leh? Faaaaakes"
    }
  ],
  "content_box_buttons": {
    "like": "Like",
    "dislike": "Dislike",
    "report": "Report",
    "share": "Share",
    "report_cancelled": "Invalid input. Report Cancelled.",
    "repeated_report_error": "You are unable to report the same word / definition more than once.",
    "repeated_reaction_error": "You have reacted too many times. Please wait before clicking again.",
    "instagram_download": "The word image has been downloaded. Share it on Instagram and tag us @qamousapp!"
  },
  "common_terms": {
    "qamous": "Qamous",
    "user": "User",
    "language": "Language",
    "search": "Search",
    "all_rights_reserved": "All rights reserved.",
    "privacy_policy": "Privacy Policy",
    "terms_of_service": "Terms of Service",
    "under_construction": "This page is under construction",
    "under_construction_message": "It will be completed in {{days}} days, {{hours}} hours, {{minutes}} minutes, and {{seconds}} seconds."
  },
  "search_results": {
    "word": "Search Results for \"{{searchTerm}}\"",
    "definition": "Here are the search results for the term \"{{searchTerm}}\"."
  },
  "add_word": {
    "title": "Add a New Word",
    "add_word": "Add Word",
    "enter_word_ar": "Enter the word in Arabic",
    "enter_word_en": "Enter the word in Franco-Arabic",
    "enter_definition_ar": "Enter the definition in Arabic",
    "enter_definition_en": "Enter the definition in English",
    "enter_example_en": "Enter an example in English",
    "country_selection": "Select the country / countries of origin (if applicable)",
    "ar_definition-error": "Arabic definition is required if English definition and Franco-Arabic word are not provided",
    "ar_word-error": "The Arabic word must be in Arabic",
    "success_message": "Word added successfully",
    "error_message": "Failed to add word"
  },
  "login": {
    "title": "Log in",
    "enter_username": "Enter your username here",
    "enter_password": "Enter your password here",
    "forgot_password": "Forgot password?",
    "login": "Log in",
    "sign_up": "Sign up",
    "continue_with": "Or continue with",
    "username_required": "Username is required",
    "invalid_username": "Invalid username",
    "password_required": "Password is required",
    "success_message": "Login successful",
    "error_message": "Login failed: Invalid username or password",
    "must_login": "You must be logged in to perform this action"
  },
  "sign_up": {
    "title": "Sign Up",
    "enter_username": "Enter your username here",
    "enter_first_name": "Enter your first name here",
    "enter_last_name": "Enter your last name here",
    "enter_dob": "Enter your date of birth here",
    "enter_email": "Enter your email here",
    "enter_password": "Enter your password here",
    "confirm_password": "Confirm your password here",
    "username_error": "Username is required",
    "username_invalid_error": "Username cannot contain ', \", or ;",
    "first_name_error": "First name is required",
    "last_name_error": "Last name is required",
    "dob_error": "Date of birth is required",
    "email_error": "Email is required",
    "email_invalid_error": "Invalid email",
    "password_error": "Password is required",
    "password_confirmation_error": "Password confirmation must match password",
    "success_message": "You have successfully registered! Please use your credentials to log in.",
    "error_message": "Sign up failed",
    "success_message_part": "successfully registered",
    "sign_up_button": "Sign up",
    "log_in_button": "Log in"
  },
  "forgot_password": {
    "title": "Forgot Something?",
    "description_1": "Don't worry! We've got you covered.",
    "description_2": "Just enter your email address below and we'll send you a link to reset your password.",
    "enter_email": "Enter your email address here",
    "go_back_button": "Go Back",
    "email_sent": "Password reset email sent",
    "email_error": "Failed to reset password"
  },
  "reset_password": {
    "title": "Reset Password",
    "description": "Enter your email address to reset your password.",
    "enter_password": "Enter your password here",
    "password_reset_success": "Password reset successful",
    "password_reset_error": "Failed to reset password"
  },
  "user_profile": {
    "logout": "Log out",
    "hi": "Hi,",
    "points": "Total Points",
    "switch_translation": "Switch translation",
    "franco_arabic": "FRANCO-ARABIC",
    "arabic": "ARABIC",
    "definition_like_error": "You cannot like your own definitions",
    "definition_dislike_error": "You cannot dislike your own definitions",
    "definition_report_error": "You cannot report your own definitions",
    "delete_account": "Delete Account",
    "delete_account_confirmation": "Are you sure you want to delete your account? This action cannot be undone",
    "pick_other_definitions": "Pick other definitions",
    "no_posts": "No posts found",
    "no_posts_description": "You haven't added any words or definitions yet. Start contributing to the Qamous community by adding new words and definitions!",
    "add_first_definition": "Add your first definition"
  },
  "report_dialog": {
    "why": "Why are you reporting this {{reportType}}?",
    "what": "Are you reporting the word or the definition?",
    "word": "Word",
    "definition": "Definition"
  },
  "page_not_found": {
    "404": "404",
    "hmmm": "Hmmm...",
    "text": "We couldn't find the page you were looking for!"
  },
  "footer": {
    "franco_arabic_basics": "Franco-Arabic Basics",
    "about": "About Qamous",
    "blog": "Blog",
    "advertise": "Advertise With Us",
    "opportunities": "Career Opportunities"
  },
  "about": {
    "title": "Welcome to Qamous!",
    "text_1": "A project founded by ",
    "founder": "Anthony Elkommos Youssef",
    "text_2": ". The goal of this project is to provide a platform for Arabic speakers to learn other dialects of Arabic (including slang) and to allow others to learn Arabic more easily. We aim to provide a comprehensive resource for learners of Arabic dialects, including the Egyptian, Levantine, Gulf, and many more dialects.",
    "text_3": "This project is open source and can be found on ",
    "github": "GitHub",
    "text_4": ". By supporting Qamous on GitHub, you'll be contributing directly to the ongoing development and improvement of this vital resource for Arabic language enthusiasts worldwide.",
    "text_5": "Your support can take many forms:",
    "text_6": "Spread the Word:",
    "text_7": "Share Qamous with your friends, colleagues, and fellow language enthusiasts. Together, we can build a strong community around this project and foster a greater appreciation for the Arabic language and its many unique and rich dialects. The more people who know about Qamous, the more valuable it becomes as a resource for learners and speakers of Arabic.",
    "text_8": "Contribute Content:",
    "text_9": "If you're a native speaker of an Arabic dialect or have expertise in Arabic linguistics, consider contributing words, definitions, examples, and other content to Qamous. Your contributions will help enrich the platform and make it more useful and engaging for learners of Arabic dialects. By sharing your knowledge and insights, you can help others learn and appreciate the beauty and diversity of Arabic language and culture.",
    "text_10": "Contribute Code:",
    "text_11": "If you're a developer or have experience in software development or design, consider ",
    "text_12": "contributing to the Qamous project on GitHub",
    "text_13": ". Whether you're skilled in front-end design, back-end development, database management, or other areas of expertise, your contributions can help enhance the functionality, usability, and performance of the platform. By collaborating with other developers and contributors, you can help shape the future of Qamous and make it an even more valuable resource for Arabic language learners and enthusiasts.",
    "text_14": "Sponsor the Project:",
    "text_15": "If you or your organization is passionate about supporting language learning, cultural exchange, and the preservation of Arabic dialects, consider sponsoring the Qamous project. Your sponsorship can help cover the costs of hosting, maintenance, development, and promotion, ensuring that Qamous remains a free, accessible, and high-quality resource for Arabic language enthusiasts worldwide. By sponsoring Qamous, you'll be making a meaningful contribution to the preservation and promotion of Arabic language and culture. Your sponsorship will enable us to dedicate more time and resources to roll out Qamous faster and build new features that benefit the Arabic language community.",
    "sponsor": "Sponsor Qamous",
    "text_16": "Qamous is more than just a dictionary; it's a celebration of Arabic language and culture. With your support, we can take Qamous to new heights and ensure that Arabic language learners have the tools they need to succeed.",
    "text_17": "Together, we can make Qamous a vibrant, inclusive, and dynamic platform for learning, sharing, and celebrating the richness of Arabic language and culture. Thank you for your support and for being part of the Qamous community!",
    "text_18": "Learn about the latest Qamous team's research",

    "description": "Qamous is a platform dedicated to preserving and promoting colloquial Arabic words and phrases. Our mission is to provide a comprehensive resource for learners of Arabic dialects, including the Egyptian, Levantine, Gulf, and many more dialects. By offering a diverse collection of words, definitions, and examples, we aim to facilitate language learning and cultural exchange. Qamous is designed to be an inclusive and interactive space where users can contribute, learn, and engage with the richness of Arabic language and culture."
  },
  "common": {
    "ok": "OK",
    "cancel": "Cancel",
    "confirm": "Confirm",
    "submit": "Submit",
    "edit": "Edit",
    "search": "Search",
    "data_fetch_error": "Data fetching error occurred. Please try again later.",
    "beta_warning": "Please excuse any issues you encounter; we're currently in beta and working hard to improve. Thank you for your understanding!",
    "copyright": "Copyright © 2024 Qamous. All rights reserved."
  },
  "blog": {
    "title": "Blog",
    "read_more": "Read More",
    "no_posts": "No blog posts found",
    "please_log_in_to_post": "Please <a href='/login' class='login-link'>log in</a> to post",
    "enter_title": "Enter the title",
    "enter_content": "Write a post (Markdown supported)...",
    "post": "Post",
    "preview": "Preview",
    "edit": "Edit",
    "markdown_guide": "Markdown Guide"
  },
  "advanced_search": {
    "title": "Advanced Search",
    "select_country": "Select Country",
    "search": "Search",
    "no_results_found": "No results found",
    "error_message": "An error occurred while fetching data. Please try again later.",
    "results_for": "Results for "
  },
  "chatbot": {
    "title": "Qamous Chatbot",
    "input_placeholder": "Type your message...",
    "send": "Send",
    "sending": "Sending...",
    "sources": "Sources",
    "definitions": "Definitions",
    "error_message": "Sorry, an error occurred. Please try again.",
    "arabic": "Arabic",
    "franco_arabic": "Franco-Arabic"
  },
  "search": {
    "placeholder": "Search for a word or phrase..."
  }
}