{
  "toolbar_items": {
    "home": "Home",
    "advanced_search": "Advanced Search",
    "word_of_the_day": "Word of the Day",
    "advertise": "Advertise"
  },
  "sample_advertisements": [
    "Discover the world with our premium travel packages. Book now and save 20%!",
    "Upgrade your style with our latest fashion collection. Limited stock available!",
    "Experience the best dining in town with our exclusive deals. Reserve your table today!",
    "Boost your productivity with our advanced tech gadgets. Shop now and get free shipping!",
    "Transform your home with our unique decor items. Order now and get a special discount!"
  ],
  "sample_home": [
    {
      "word": "Qamous",
      "definition": "Welcome to Qamous, a platform for learning colloquial Arabic words and phrases. Our goal is to provide a comprehensive resource for learners of Arabic dialects, including the Egyptian, Levantine, Gulf, and many more dialects."
    },
    {
      "word": "Al-naharda",
      "definition": "The Arabic word \"النهاردة\" (pronounced: al-naharda) translates to \"today\" in English. It is commonly used in various Arabic dialects, including the Egyptian dialect. This term is employed to refer to the current day or the present moment, indicating the temporal context of events or discussions. In English, it is synonymous with \"today,\" representing the immediate time frame in which a conversation or situation is taking place.",
      "example": "Al-naharda ana mabsout"
    },
    {
      "word": "Ma3lish",
      "definition": "The Arabic word \"معلش\" (pronounced: ma3lish) is a versatile term used in daily conversations, particularly in the Egyptian dialect. Its primary translation is \"never mind\" or \"it's okay\" in English. Ma3lish is employed to express forgiveness, understanding, or to downplay a situation. It serves as a multi-purpose phrase, conveying a sense of reassurance or dismissing minor issues. In various contexts, ma3lish helps maintain a casual and easygoing atmosphere during interactions.",
      "example": "Ma3lish, hatet3awwad"
    },
    {
      "word": "Yalla",
      "definition": "The Arabic word \"يلا\" (pronounced: yalla) is a popular term used across different Arabic dialects, including Levantine, Egyptian, and Gulf dialects. Yalla is a versatile expression that conveys encouragement, motivation, or a sense of urgency. Its primary translation is \"let's go\" or \"come on\" in English. Yalla is commonly used to spur action, rally enthusiasm, or prompt others to join in an activity. Whether used casually among friends or in more formal settings, yalla embodies a dynamic and spirited tone, encouraging engagement and participation.",
      "example": "Tab yalla ana mestaneek"
    },
    {
      "word": "3afak",
      "definition": "The Arabic word \"عفك\" (pronounced: 3afak) is a polite term used in Moroccan Arabic to request or offer something. Its primary translation is \"please\" in English. 3afak is employed to make a polite request, seek assistance, or express courtesy in interactions. This term reflects the cultural emphasis on politeness and respect in Moroccan society, where social etiquette plays a significant role in communication.",
      "example": "3afak, 3tini l-ma"
    },
    {
      "word": "Smaitary",
      "definition": "\"Smaitary\" is an informal Arabic term that refers to intense cold weather. The word is derived from the fusion of \"squee\", or \"saq3\", and \"rain\", or \"matar\", forming \"Samaitary\". Over time, the \"sa\" was transformed into just \"s\", resulting in \"Smaitary\". In Libya, cold weather is described using various terms such as \"safengri\", \"smaitary\", and \"shaloondi\".",
      "example": "Al yawm al-jaw smaitary"
    }
  ],
  "content_box_buttons": {
    "like": "Like",
    "dislike": "Dislike",
    "report": "Report"
  },
  "common_terms": {
    "qamous": "Qamous",
    "user": "User",
    "language": "Language",
    "search": "Search",
    "all_rights_reserved": "All rights reserved.",
    "privacy_policy": "Privacy Policy",
    "terms_of_service": "Terms of Service",
    "under_construction": "This page is under construction",
    "under_construction_message": "It will be completed in {{days}} days, {{hours}} hours, {{minutes}} minutes, and {{seconds}} seconds."
  },
  "search_results": {
    "word": "Search Results for \"{{searchTerm}}\"",
    "definition": "Here are the search results for the term \"{{searchTerm}}\"."
  }
}